app/controllers/v1/user_pet_bid_controller.rb

  def show
    user = User.where(id: params[:id]).take
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]