app/controllers/v1/user_pet_bid_controller.rb

INSERT INTO "pets" ("id", "name", "status", "photo_urls", "tags", "category_id", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "user_pet_bids" ("user_id", "pet_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["pet_id", 1], ["amount", "500.0"], ["created_at", "2020-04-18 14:49:01.855129"], ["updated_at", "2020-04-18 14:49:01.855129"]]
---
  def create
    result = ValidateUserPetBid.new(request_params).validate
    errors = result.instance_variable_get(:@errors)
    return render_failure_json_response('user bid pet', errors) unless errors.blank?
    UserPetBid.create(user_id: request_params['user_id'], pet_id: request_params['pet_id'], amount: request_params['amount'])